Tekla Open API Reference for Tekla Structures 2025
Hideable.HiddenFlags Enumeration
 The flag for keeping track of objects hidden status.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum HiddenFlags
Public Enumeration HiddenFlags
Members
Member name | Value | Description
NotHidden | 0 |  Not hidden.
HiddenBySelf | 1 |  Hidden by self (meaning nothing else is hiding it).
HiddenByParent | 2 |  Hidden by parent (the objects parent is hidden and thus this object is also hidden).
See Also
Reference
Tekla.Structures.Drawing Namespace